In [47]:
import sqlalchemy
import sql
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3

In [33]:
con = sqlite3.connect("hr.db")
cur = con.cursor()

In [34]:
%reload_ext sql

In [35]:
%sql sqlite:///hr.db

In [16]:
departments_data = pd.read_csv ("departments.csv")
departments_data.dropna()
departments_data.head()

   2 Architect Group  30001  L0001
0  5  Software Group  30002  L0002
1  7     Design Team  30003  L0003

In [18]:
departments_data = pd.DataFrame(departments_data)

departments_data.rename(columns = {'2':'DEPT_ID_DEP','Architect Group':'DEP_NAME','30001':'MANAGER_ID','L0001':'LOC_ID'}, inplace=True)
departments_data

   DEPT_ID_DEP        DEP_NAME  MANAGER_ID LOC_ID
0            5  Software Group       30002  L0002
1            7     Design Team       30003  L0003

In [19]:
departments_data.loc[len(departments_data.index)] = [2,'Architect Group',30001,'L0001']
departments_data

#only use this code once as it continuously adds a row to the dataframe

   DEPT_ID_DEP         DEP_NAME  MANAGER_ID LOC_ID
0            5   Software Group       30002  L0002
1            7      Design Team       30003  L0003
2            2  Architect Group       30001  L0001

In [21]:
%sql --persist departments_data

 * sqlite:///hr.db

'Persisted departments_data'

In [36]:
%sql select name from sqlite_master where type='table';

 * sqlite:///hr.db
Done.

[('employees_data',),
 ('jobshistory_data',),
 ('locations_data',),
 ('jobs_data',),
 ('departments_data',)]

In [37]:
%sql select count(name) from PRAGMA_TABLE_INFO('jobshistory_data')

 * sqlite:///hr.db
Done.

[(5,)]

In [38]:
%sql select * from departments_data;

 * sqlite:///hr.db
Done.

[(0, 5, 'Software Group', 30002, 'L0002'),
 (1, 7, 'Design Team', 30003, 'L0003'),
 (2, 2, 'Architect Group', 30001, 'L0001')]

In [39]:
%sql select E.f_name,E.l_name,J.job_title from employees_data as E, jobs_data as J\
INNER JOIN jobshistory_data as JH on E.EMP_ID = JH.EMP_ID\
where E.dep_id = '5';

 * sqlite:///hr.db
Done.

[('Alice', 'James', 'Sr.Software Developer'),
 ('Steve', 'Wells', 'Sr.Software Developer'),
 ('Santosh', 'Kumar', 'Sr.Software Developer'),
 ('Ann', 'Jacob', 'Sr.Software Developer'),
 ('Alice', 'James', 'Jr.Software Developer'),
 ('Steve', 'Wells', 'Jr.Software Developer'),
 ('Santosh', 'Kumar', 'Jr.Software Developer'),
 ('Ann', 'Jacob', 'Jr.Software Developer'),
 ('Alice', 'James', 'Jr.Software Developer'),
 ('Steve', 'Wells', 'Jr.Software Developer'),
 ('Santosh', 'Kumar', 'Jr.Software Developer'),
 ('Ann', 'Jacob', 'Jr.Software Developer'),
 ('Alice', 'James', 'Jr. Architect'),
 ('Steve', 'Wells', 'Jr. Architect'),
 ('Santosh', 'Kumar', 'Jr. Architect'),
 ('Ann', 'Jacob', 'Jr. Architect'),
 ('Alice', 'James', 'Lead Architect'),
 ('Steve', 'Wells', 'Lead Architect'),
 ('Santosh', 'Kumar', 'Lead Architect'),
 ('Ann', 'Jacob', 'Lead Architect'),
 ('Alice', 'James', 'Jr. Designer'),
 ('Steve', 'Wells', 'Jr. Designer'),
 ('Santosh', 'Kumar', 'Jr. Designer'),
 ('Ann', 'Jacob', 'Jr. Designer'),
 ('Alice', 'James', 'Jr. Designer'),
 ('Steve', 'Wells', 'Jr. Designer'),
 ('Santosh', 'Kumar', 'Jr. Designer'),
 ('Ann', 'Jacob', 'Jr. Designer'),
 ('Alice', 'James', 'Sr. Designer'),
 ('Steve', 'Wells', 'Sr. Designer'),
 ('Santosh', 'Kumar', 'Sr. Designer'),
 ('Ann', 'Jacob', 'Sr. Designer'),
 ('Alice', 'James', 'Sr. Designer'),
 ('Steve', 'Wells', 'Sr. Designer'),
 ('Santosh', 'Kumar', 'Sr. Designer'),
 ('Ann', 'Jacob', 'Sr. Designer'),
 ('Alice', 'James', 'Sr. Architect'),
 ('Steve', 'Wells', 'Sr. Architect'),
 ('Santosh', 'Kumar', 'Sr. Architect'),
 ('Ann', 'Jacob', 'Sr. Architect')]

In [40]:
%sql select E.f_name,E.l_name,J.job_title, JH.start_date from employees_data as E\
INNER JOIN jobshistory_data as JH on E.EMP_ID = JH.EMP_ID\
INNER JOIN jobs_data as J on E.JOB_ID = J.JOB_IDENT\
where E.dep_id = '5';

 * sqlite:///hr.db
Done.

[('Alice', 'James', 'Sr.Software Developer', '08/01/2001'),
 ('Steve', 'Wells', 'Jr.Software Developer', '08/16/2001'),
 ('Santosh', 'Kumar', 'Jr.Software Developer', '08/16/2000'),
 ('Ann', 'Jacob', 'Sr. Designer', '08/16/2016')]

In [42]:
%sql select E.dep_id, E.f_name, E.l_name, D.dept_id_dep, D.dep_name from employees_data as E\
left outer join departments_data as D on E.dep_id = D.dept_id_dep;

 * sqlite:///hr.db
Done.

[(2, 'John', 'Thomas', 2, 'Architect Group'),
 (5, 'Alice', 'James', 5, 'Software Group'),
 (5, 'Steve', 'Wells', 5, 'Software Group'),
 (5, 'Santosh', 'Kumar', 5, 'Software Group'),
 (2, 'Ahmed', 'Hussain', 2, 'Architect Group'),
 (2, 'Nancy', 'Allen', 2, 'Architect Group'),
 (7, 'Mary', 'Thomas', 7, 'Design Team'),
 (7, 'Bharath', 'Gupta', 7, 'Design Team'),
 (7, 'Andrea', 'Jones', 7, 'Design Team'),
 (5, 'Ann', 'Jacob', 5, 'Software Group')]

In [43]:
%sql select E.dep_id, E.f_name, E.l_name, D.dept_id_dep, D.dep_name from employees_data as E\
left outer join departments_data as D on E.dep_id = D.dept_id_dep\
where E.b_date < 1980;

 * sqlite:///hr.db
Done.

[(2, 'John', 'Thomas', 2, 'Architect Group'),
 (5, 'Alice', 'James', 5, 'Software Group'),
 (2, 'Nancy', 'Allen', 2, 'Architect Group'),
 (7, 'Mary', 'Thomas', 7, 'Design Team')]

In [44]:
%sql select E.dep_id, E.f_name, E.l_name, D.dept_id_dep, D.dep_name from employees_data as E\
left outer join departments_data as D on E.dep_id = D.dept_id_dep\
and E.b_date < 1980;

 * sqlite:///hr.db
Done.

[(2, 'John', 'Thomas', 2, 'Architect Group'),
 (5, 'Alice', 'James', 5, 'Software Group'),
 (5, 'Steve', 'Wells', None, None),
 (5, 'Santosh', 'Kumar', None, None),
 (2, 'Ahmed', 'Hussain', None, None),
 (2, 'Nancy', 'Allen', 2, 'Architect Group'),
 (7, 'Mary', 'Thomas', 7, 'Design Team'),
 (7, 'Bharath', 'Gupta', None, None),
 (7, 'Andrea', 'Jones', None, None),
 (5, 'Ann', 'Jacob', None, None)]

In [45]:
%sql select E.dep_id, E.f_name, E.l_name, D.dept_id_dep, D.dep_name from employees_data as E\
left outer join departments_data as D on E.dep_id = D.dept_id_dep\
where E.sex = 'M';

 * sqlite:///hr.db
Done.

[(2, 'John', 'Thomas', 2, 'Architect Group'),
 (5, 'Steve', 'Wells', 5, 'Software Group'),
 (5, 'Santosh', 'Kumar', 5, 'Software Group'),
 (2, 'Ahmed', 'Hussain', 2, 'Architect Group'),
 (7, 'Bharath', 'Gupta', 7, 'Design Team')]

In [46]:
%sql select E.dep_id, E.f_name, E.l_name, D.dept_id_dep, D.dep_name from employees_data as E\
left outer join departments_data as D on E.dep_id = D.dept_id_dep\
and E.sex = 'M';

 * sqlite:///hr.db
Done.

[(2, 'John', 'Thomas', 2, 'Architect Group'),
 (5, 'Alice', 'James', None, None),
 (5, 'Steve', 'Wells', 5, 'Software Group'),
 (5, 'Santosh', 'Kumar', 5, 'Software Group'),
 (2, 'Ahmed', 'Hussain', 2, 'Architect Group'),
 (2, 'Nancy', 'Allen', None, None),
 (7, 'Mary', 'Thomas', None, None),
 (7, 'Bharath', 'Gupta', 7, 'Design Team'),
 (7, 'Andrea', 'Jones', None, None),
 (5, 'Ann', 'Jacob', None, None)]